{
    "about": {
        "title": "Teaching Staff",
        "description": "The faculty of R K International School (RKIS) gives a special touch to the holistic and well-rounded education that each student is promised here. An educator not only facilitates a student in developing interest and understanding a subject, but also functions, at the same time, as a mentor to them. The faculty of RKIS consists of 100 full-time highly qualified teachers, who have extensive teaching experience in their respective fields. Every deucator imbibes the culture and ethos that is the thread, which unites the entire teaching fraternity of RKIS. This academic community, not only shares knowledge through the regular teaching sessions, but also engages students in a rich and varied extracurricular activities programs – be it hobbies, clubs, educational trips or excursions, social service or student exchange to various countries."
    },
    "departments": [
        {
            "id": "principal",
            "button_text": "Principal",
            "members": [
                {
                    "name": "Ms. Nidhi Nehra",
                    "designation": "Principal",
                    "image": "../../assets/images/principla.jpg?v=1.4",
                    "description": "Childhood is a state of mind which ends the moment a puddle is first viewed as an obstacle instead of an opportunity. The most significant phase of human life, childhood, is known for its naivety, innocence and simplicity. Neuroscience states that neurons are highly active between 0 to 8 years of age, thus resulting in formation of habits, acquiring moral values and etiquette and developing concepts for a lifetime. Therefore real education needs to be imparted in these years so that the roots are strong enough to bring up an intellectual youth having good habits, values and etiquette. Schooling at this age needs to be very effective in instilling moral values of honesty, integrity and truthfulness along with self confidence and self esteem. From kindergarten, we have been laying the foundation and have seen our students passing out in XII as confident responsible adults ready to face challenges in their lives. Holistic education is the need of the hour to build a strong nation of youth equally strong in body mind and soul. We at Indus have been pursuing our modest endeavors to contribute in producing a new generation of adults physically strong, mentally balanced and emotionally stable. With the blessings of the Almighty, and good wishes of our well wishers we hope to continue successfully treading the path of Craftsmanship in generating noble citizens of the Nation."
                }
            ]
        },
      
        {
            "id": "exam_incharge",
            "button_text": "Examination Department",
            "members": [
                
                {
                    "name": "Mr. Subash Chand",
                    "designation": "Head of Department",
                    "image": "../../assets/images/staff-images/subhash.jpg?v=1.4",
                    "description": ""
                }
            ]
        },
      
        {
            "id": "hd",
            "button_text": "Hindi & Sanskrit Department",
            "head": {
                "name": "Ms. Dayawati",
                "designation": "Head of Department",
                "image": "../../assets/images/staff-images/dayawati.jpg?v=1.4",
                "description": "Ms. Dayawati holds the esteemed position of Head of Department for the Hindi department at R K International School. With her extensive experience and deep passion for the Hindi language and literature, she plays a pivotal role in shaping the academic landscape of the school. In her capacity as the Head of Department, Ms. Dayawati demonstrates exceptional leadership and expertise. She is responsible for overseeing the Hindi curriculum, ensuring its alignment with educational standards, and continually enhancing it to foster a deep appreciation for the language among students. Ms. Dayawati's commitment to educational excellence is evident in her dedication to promoting innovative teaching methods and creating a stimulating learning environment. She works closely with her team of educators to inspire a love for Hindi literature and language, helping students develop strong linguistic skills and a profound understanding of the cultural significance of Hindi. With her profound knowledge of Hindi and her unwavering dedication to the Hindi department at R K International School, Ms. Dayawati is instrumental in nurturing a generation of students who are not only proficient in the language but also deeply connected to its rich cultural heritage. Her contributions continue to make a significant impact on the academic and cultural fabric of the school."
            },
            "featured_teacher": {
                "name": "Ms. Prabha",
                "designation": "TGT",
                "image": "../../assets/images/staff-images/prabha.jpg?v=1.4",
                "description": "Ms. Prabha is a highly qualified teacher with M.A. & Bachelor of Education. With a vast experience of 30 years in teaching and has been working with us since 11 years, she loves disseminating knowledge to connect the new generation with our roots, i.e. Indian culture. He fancies exploring Indian culture and listening to devotional songs. Children adore her for her story sessions based on Indian mythology in morning assemblies. She trains the students in Sanskrit shlok Vadan & prepare them for various intra and inter- school competitions."
            },
            "members": [
                {
                    "name": "Ms. Savita",
                    "designation": "TGT Hindi",
                    "image": "../../assets/images/staff-images/savita.jpg?v=1.4"
                },
                {
                    "name": "Ms. Seema Rani",
                    "designation": "TGT Hindi",
                    "image": "../../assets/images/staff-images/seema.JPG?v=1.4"
                },
                {
                    "name": "Ms. Sonu",
                    "designation": "TGT Hindi",
                    "image": "../../assets/images/staff-images/sonu.JPG?v=1.4"
                },
                {
                    "name": "Ms. Meenakshi",
                    "designation": "PRT Hindi",
                    "image": "../../assets/images/staff-images/meenakshi.jpg?v=1.4"
                },
                {
                    "name": "Ms. Suman Dahiya",
                    "designation": "TGT Hindi",
                    "image": "../../assets/images/staff-images/suman.JPG?v=1.4"
                },
                {
                    "name": "Ms. Sunita",
                    "designation": "PRT Hindi",
                    "image": "../../assets/images/staff-images/sunita.jpg?v=1.4"
                }
            ]
        },
        {
            "id": "ed",
            "button_text": "English Department",
         
            "members": [
             
                {
                    "name": "Ms. Binny",
                    "designation": "TGT English",
                    "image": "../../assets/images/staff-images/binny.jpg?v=1.4"
                },
                {
                    "name": "Ms. Bhawna Bhardwaj",
                    "designation": "TGT English",
                    "image": "../../assets/images/staff-images/bhavna.jpg?v=1.4"
                }
            ]
        },
        {
            "id": "sd",
            "button_text": "Science Department",
            "head": {
                "name": "Ms. Poonam Dahiya",
                "designation": "Head of Department",
                "image": "../../assets/images/staff-images/poonam.jpg?v=1.4",
                "description": "Ms Poonam Dahiya is a passionate Science teacher with Master's in Technology ( Electronics & communication) and Bachelor's Degree in Education . She has also worked as a lecturer in IITB College, Jhundpur. With more than nine years of teaching experience, she has been serving RKIS for the last six years. She endeavours to simplify scientific concepts to foster a love for the subject in her students. She wishes her students to be scientifically informed, caring, and responsible individuals who can think critically and make the right choices for themselves, environment and society. With a keen desire to make science enjoyable and application based she focuses on strengthening of core concepts. Constantly up skilling herself and reading remain her abiding pursuits."
            },
            "members": [
                
                {
                    "name": "Mr. Himanshu",
                    "designation": "PGT Physics",
                    "image": "../../assets/images/staff-images/himanshu.jpg?v=1.4"
                },
                {
                    "name": "Mr. Ranjan",
                    "designation": "PGT Chemistry",
                    "image": "../../assets/images/staff-images/avatar.jpg?v=1.4"
                },
                {
                    "name": "Ms. Shweta Shrivastav",
                    "designation": "TGT Science",
                    "image": "../../assets/images/staff-images/shweta.jpg?v=1.4"
                },
                {
                    "name": "Ms. Aakanksha",
                    "designation": "TGT Science",
                    "image": "../../assets/images/staff-images/akansha.jpg?v=1.4"
                },
                {
                    "name": "Ms. Bimal",
                    "designation": "TGT Science",
                    "image": "../../assets/images/staff-images/bimal.png?v=1.4"
                },
                {
                    "name": "Ms. Priya",
                    "designation": "PRT Science",
                    "image": "../../assets/images/staff-images/priya.jpg?v=1.4"
                }
            ]
        },
        {
            "id": "commerce",
            "button_text": "Commerce Department",
            "members": [
                {
                    "name": "Mr. Rohit Puri",
                    "designation": "PGT Commerce",
                    "image": "../../assets/images/staff-images/rohit.jpg?v=1.4",
                    "description": "Mr. Rohit Puri is M.Com, B.Ed and has been working in this line from the last 14 years and have a sound command over his subjects. He joined R K International School in 2021 and it's been a wonderful journey since then. He is always ready to work for the betterment of child's future and in the same context he usually take counseling sessions for grade XI & XII students for their career planning. He is popular among students for his cooperative & guiding nature."
                },
                {
                    "name": "Mr. Subash Chand",
                    "designation": "PGT Commerce",
                    "image": "../../assets/images/staff-images/subhash.jpg?v=1.4",
                    "description": "Mr. subash chand is M. Com and B.ed. He has been working in R K International School as PGT Economics from last two years and his total teaching experience is 14 years. He is well confident in his subject. He guides the students in very polite manner and usually organize doubt session regarding the subject and career."
                }
            ]
        },
        {
            "id": "mathematics",
            "button_text": "Mathematics Department",
            "head": {
                "name": "Ms. Promila",
                "designation": "Head of Department",
                "additionalRole": "PGT Mathematics",
                "image": "../../assets/images/staff-images/promila.jpg?v=1.4",
                "description": "As the Maths HOD, Promila understands the importance of fostering a growth mindset among our students. She firmly believes that every student can excel in Mathematics with the right guidance, support, and motivation. By nurturing a positive learning environment, She instill confidence and encourage students to embrace challenges, persist in problem-solving, and celebrate their successes."
            },
            "members": [
                {
                    "name": "Mr. Sanjay Jha",
                    "designation": "PGT Mathematics",
                    "image": "../../assets/images/staff-images/sanjay.jpg?v=1.4"
                },
                {
                    "name": "Mr. Vikas Dahiya",
                    "designation": "TGT Mathematics",
                    "image": "../../assets/images/staff-images/vikash.jpg?v=1.4"
                },
                {
                    "name": "Mr. Anand",
                    "designation": "TGT Mathematics",
                    "image": "../../assets/images/staff-images/anand.png?v=1.4"
                },
                {
                    "name": "Ms. Suvidha",
                    "designation": "TGT Mathematics",
                    "image": "../../assets/images/staff-images/SUVIDHA.JPG?v=1.4"
                },
                {
                    "name": "Ms. Anju",
                    "designation": "TGT Mathematics",
                    "image": "../../assets/images/staff-images/anju.jpeg"
                },
                {
                    "name": "Ms. Pooja",
                    "designation": "TGT Mathematics",
                    "image": "../../assets/images/staff-images/pooja.png"
                },
                {
                    "name": "Ms. Sarita",
                    "designation": "TGT Mathematics",
                    "image": "../../assets/images/staff-images/sarita.jpg"
                }
            ]
        },
        {
            "id": "social_science",
            "button_text": "Social Science Department",
            "head": {
                "name": "Ms. Pinki Hooda",
                "designation": "Head of Department",
                "additionalResponsibility": "House Master of Gopal House",
                "image": "../../assets/images/staff-images/pinki.jpg?v=1.4",
                "description": "A passionate facilitator of History and Social Sciences, she promotes an environment of erudite discussions and debates. With 17 years of teaching experience, she has been serving RKIS for the last 7 years. She has been instrumental in organizing MUN. It is her firm belief that for a comprehensive assimilation of the subject the students should understand the interrelation of incidents in History and relate them to the present experience. As a facilitator, she believes that her work can only be justified if her students are able to remember her for her contribution in shaping their lives."
            },
            "members": [
                {
                    "name": "Mr. Rahul Singh",
                    "designation": "PGT Political Science",
                    "image": "../../assets/images/staff-images/rahul.jpg?v=1.4"
                },
                {
                    "name": "Ms. Antim Gautam",
                    "designation": "TGT Social Science",
                    "image": "../../assets/images/staff-images/antim.jpg?v=1.4"
                },
                {
                    "name": "Ms. Anita",
                    "designation": "TGT Social Science",
                    "image": "../../assets/images/staff-images/anita.jpg?v=1.4"
                },
                {
                    "name": "Mr. Gourav",
                    "designation": "TGT Social Science",
                    "image": "../../assets/images/staff-images/gaurav.jpg?v=1.4"
                }
            ]
        },
        {
            "id": "computer",
            "button_text": "Computer Department",
            "head": {
                "name": "Shivani Garg",
                "designation": "Head of Department",
                "image": "../../assets/images/staff-images/shivani.jpg?v=1.4",
                "description": "The best programs are written so that computing machines can perform them quickly and so that human beings can understand them clearly. Ms. Shivani Garg is a Post Graduate Teacher at RKIS. She has an experience of 3 years. She is popular among students because of her friendly nature which make students comfortable in her company."
            },
            "members": [
                {
                    "name": "Ms. Sheetal",
                    "designation": "PRT Computer",
                    "image": "../../assets/images/staff-images/sheetal.jpg?v=1.4"
                },
                {
                    "name": "Ms. Manju",
                    "designation": "TGT Computer",
                    "image": "../../assets/images/staff-images/MANJU.JPG?v=1.4"
                }
            ]
        },
      
        {
            "id": "performing_arts",
            "button_text": "Performing Arts Department",
            "members": [
               
                {
                    "name": "Ms. Seema Devi",
                    "designation": "PGT Fine Arts",
                    "image": "../../assets/images/staff-images/seema_art.jpg?v=1.4",
                    "description": "Ms. Seema Devi is Master's in Fine Arts, Certified in arts and craft. She has a total experience of 11 years. She is phenomenal in her skills and very creative. She is very resourceful as she knows very well the best way to use waste and discarded materials. She always surprises the audience when they come to know the materials used in the article. She is very good in motivating the students in creativity. Students really enjoy her slots and come out with the artists hidden in them."
                }
                
            ]
        },
      
        {
            "id": "primary_teachers",
            "button_text": "Primary Teachers",
            "members": [
                {
                    "name": "Ms. Renuka",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/renuka.jpg?v=1.4",
                    "description": "Ms. Renuka Verma BA, Bed, working as a PRT Hindi in RK International School. She has 20 years of experience as a PRT in R K I S and feels proud to be a part of R K International School. For her, teaching isn't all about learning ABC's and 123's. It's about building confidence in students to help them with the drive to succeed. She opts this passion because she has love for sharing knowledge and she wants to achieve confidence, self-worth, and a love of learning."
                },
                {
                    "name": "Ms. Gayatri Kaushal",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/gayatri.jpg?v=1.4",
                    "description": "Ms. Gayatri Kaushal BA, Bed, working as a PRT in Rk International School from the last 7 years. She has 17 years of experience as a PRT teacher. She believes that Education is not preparation for life; education is life itself. She chooss this profession as teaching is her life's passion because her years of experience as a teacher has helped her form a teaching philosophy that guides how she helps her students succeed in the classroom and beyond. And from last 7 years she has been with this organisation."
                },
                {
                    "name": "Ms. Jyoti Vinayak",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/jyoti vinayak.jpg?v=1.4"
                },
                {
                    "name": "Ms. Sapna Saini",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/sapna.jpg?v=1.4"
                },
                {
                    "name": "Ms. Sushma Sharma",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/sushma.jpg?v=1.4"
                },
                {
                    "name": "Ms. Jyoti Saini",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/jyoti_saini.jpg?v=1.4"
                },
                {
                    "name": "Ms. Jaya",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/jaya.jpg?v=1.4"
                },
                {
                    "name": "Ms. Rekha Rani",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/rekha.jpg?v=1.4"
                },
                {
                    "name": "Ms. Nisha Dahiya",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/nisha.jpg?v=1.2"
                },
                {
                    "name": "Ms. Pooja Rana",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/pooja.jpg?v=1.4"
                },
                {
                    "name": "Ms. Neelam Dhankar",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/neelam.JPG?v=1.4"
                },
                {
                    "name": "Ms. Rachna Sharma",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/rachna.jpg?v=1.4"
                },
                {
                    "name": "Ms. Arzoo",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/aarju.jpg?v=1.4"
                },
                {
                    "name": "Ms. Usha",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/usha.jpg?v=1.4"
                },
                {
                    "name": "Ms. Aarti Singh",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/aarti.jpg?v=1.4"
                },
                {
                    "name": "Ms. Anu Arora",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/annu.jpg?v=1.4"
                },
                {
                    "name": "Ms. Kamlesh",
                    "designation": "NTT",
                    "image": "../../assets/images/staff-images/kamlesh.jpg?v=1.4"
                },
                {
                    "name": "Ms. Khushboo",
                    "designation": "PRT",
                    "image": "../../assets/images/staff-images/khushboo.jpg?v=1.4"
                }
            ]
        }
    ]
}